In [1]:
import mysql.connector as con

In [2]:
mydb=con.connect(host='localhost', user='root', password='r@shika123')

In [3]:
mydb

In [4]:
cursor=mydb.cursor()# its a pointer.

In [5]:
cursor.execute("use organisation")

# Q-1. Write an SQL query to print details of workers excluding first names, “Vipul” and “Satish” from Worker table.

In [21]:
# first need to insert both names in worker_table.
cursor.execute("insert into organisation.worker_table values(16,'Content','Vipul',20000)")
cursor.execute("insert into organisation.worker_table values(4,'Content','Rishabh D',2000000)")
#cursor.execute("insert into organisation.worker_table values(17,'Content','Satish',25000)")
mydb.commit()

In [19]:
import pandas as pd

In [20]:
pd.read_sql('select * from organisation.worker_table',mydb)

    Department_ID Department          First_Name     Salary
0               1        DSL       Rajdeep Singh  200000000
1               2        DSL           Raj Singh  100000000
2               3        DSL          Deep Singh  300000000
3               5    Content            Ritesh D    3000000
4               6    Content                Renu     400000
5               7         HR      Sonakshi Singh    5000000
6               8    Product              Salini    6000000
7               9  Developer             Natasha    8000000
8              10  Developer            Minakshi    9000000
9              11  Developer             Amitabh    9500000
10             12        DSL       Rajdeep S         200000
11             13        DSL    Sakshi Singh         800000
12             14    Content  Ranjana Shetty         900000
13             15  Developer         Sejal H         950000
14             17    Content              Satish      25000
15             16    Content               Vipul      20000
16              4    Content           Rishabh D    2000000

In [17]:
cursor.execute("Delete from worker_table where department_ID in (16)")
mydb.commit()

In [22]:
cursor.execute("select * from worker_table where first_name not in('vipul', 'satish')")
cursor.fetchall()

[(1, 'DSL', 'Rajdeep Singh', 200000000),
 (2, 'DSL', 'Raj Singh', 100000000),
 (3, 'DSL', 'Deep Singh', 300000000),
 (5, 'Content', 'Ritesh D', 3000000),
 (6, 'Content', 'Renu', 400000),
 (7, 'HR', 'Sonakshi Singh', 5000000),
 (8, 'Product', 'Salini', 6000000),
 (9, 'Developer', 'Natasha', 8000000),
 (10, 'Developer', 'Minakshi', 9000000),
 (11, 'Developer', 'Amitabh', 9500000),
 (12, 'DSL', 'Rajdeep S    ', 200000),
 (13, 'DSL', 'Sakshi Singh    ', 800000),
 (14, 'Content', 'Ranjana Shetty    ', 900000),
 (15, 'Developer', 'Sejal H    ', 950000),
 (4, 'Content', 'Rishabh D', 2000000),
 (4, 'Content', 'Rishabh D', 2000000)]

# Q-2. Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘h’ and contains six alphabets.

In [23]:
cursor.execute("insert into organisation.worker_table values(18,'Product','Rakesh',30000)")
cursor.execute("insert into organisation.worker_table values(19,'Product','Mukesh',20000)")
cursor.execute("insert into organisation.worker_table values(20,'Product','Hannah',20000)")
mydb.commit()

In [24]:
pd.read_sql('select * from organisation.worker_table',mydb)

    Department_ID Department          First_Name     Salary
0               1        DSL       Rajdeep Singh  200000000
1               2        DSL           Raj Singh  100000000
2               3        DSL          Deep Singh  300000000
3               5    Content            Ritesh D    3000000
4               6    Content                Renu     400000
5               7         HR      Sonakshi Singh    5000000
6               8    Product              Salini    6000000
7               9  Developer             Natasha    8000000
8              10  Developer            Minakshi    9000000
9              11  Developer             Amitabh    9500000
10             12        DSL       Rajdeep S         200000
11             13        DSL    Sakshi Singh         800000
12             14    Content  Ranjana Shetty         900000
13             15  Developer         Sejal H         950000
14             17    Content              Satish      25000
15             16    Content               Vipul      20000
16              4    Content           Rishabh D    2000000
17             16    Content               Vipul      20000
18              4    Content           Rishabh D    2000000
19             18    Product              Rakesh      30000
20             19    Product              Mukesh      20000
21             20    Product              Hannah      20000

In [25]:
cursor.execute("select* from worker_table where first_name like'_____h' ")
cursor.fetchall()

[(17, 'Content', 'Satish', 25000),
 (18, 'Product', 'Rakesh', 30000),
 (19, 'Product', 'Mukesh', 20000),
 (20, 'Product', 'Hannah', 20000)]

# Q-3. Write a query to validate Email of Employee.

In [26]:
cursor.execute("create table organisation.employee_email (Department_ID INT(20), email_id VARCHAR(30))")

In [27]:
cursor.execute("show tables")

In [28]:
cursor.fetchall()

[('employee_email',), ('worker_table',)]

In [29]:
cursor.execute("select first_name from worker_table")
cursor.fetchall()

[('Rajdeep Singh',),
 ('Raj Singh',),
 ('Deep Singh',),
 ('Ritesh D',),
 ('Renu',),
 ('Sonakshi Singh',),
 ('Salini',),
 ('Natasha',),
 ('Minakshi',),
 ('Amitabh',),
 ('Rajdeep S    ',),
 ('Sakshi Singh    ',),
 ('Ranjana Shetty    ',),
 ('Sejal H    ',),
 ('Satish',),
 ('Vipul',),
 ('Rishabh D',),
 ('Vipul',),
 ('Rishabh D',),
 ('Rakesh',),
 ('Mukesh',),
 ('Hannah',)]

In [30]:
cursor.execute("insert into organisation.employee_email values(1,'Rajdeep_Singh@gmail.com')")
cursor.execute("insert into organisation.employee_email values(2,'Raj_Singh@gmail.com')")
cursor.execute("insert into organisation.employee_email values(3,'deep_Singh@gmail.com')")
cursor.execute("insert into organisation.employee_email values(5,'Ritesh_D@gmail.com')")
cursor.execute("insert into organisation.employee_email values(6,'Renu@gmail.com')")
cursor.execute("insert into organisation.employee_email values(7,'Sonakshi_Singh@gmail.com')")
cursor.execute("insert into organisation.employee_email values(8,'Salini@gmail.com')")
cursor.execute("insert into organisation.employee_email values(9,'Natasha@gmail.com')")
cursor.execute("insert into organisation.employee_email values(10,'Minakshi@gmail.com')")
cursor.execute("insert into organisation.employee_email values(11,'Amitabh@gmail.com')")
cursor.execute("insert into organisation.employee_email values(12,'Rajdeep_S@gmail.com')")
cursor.execute("insert into organisation.employee_email values(13,'Sakshi_Singh@gmail.com')")
cursor.execute("insert into organisation.employee_email values(14,'Ranjana_Shetty@gmail.com')")
cursor.execute("insert into organisation.employee_email values(15,'Sejal_h@gmail.com')")
cursor.execute("insert into organisation.employee_email values(16,'satish@gmail.com')")
cursor.execute("insert into organisation.employee_email values(17,'vipul@gmail.com')")
cursor.execute("insert into organisation.employee_email values(4,'Rishabh_D@gmail.com')")
cursor.execute("insert into organisation.employee_email values(18,'Rakesh@gmail.com')")
cursor.execute("insert into organisation.employee_email values(19,'Mukesh@gmail.com')")
cursor.execute("insert into organisation.employee_email values(20,'Hannah@gmail.com')")
mydb.commit()

In [31]:
cursor.execute("select * from employee_email")
cursor.fetchall()

[(1, 'Rajdeep_Singh@gmail.com'),
 (2, 'Raj_Singh@gmail.com'),
 (3, 'deep_Singh@gmail.com'),
 (5, 'Ritesh_D@gmail.com'),
 (6, 'Renu@gmail.com'),
 (7, 'Sonakshi_Singh@gmail.com'),
 (8, 'Salini@gmail.com'),
 (9, 'Natasha@gmail.com'),
 (10, 'Minakshi@gmail.com'),
 (11, 'Amitabh@gmail.com'),
 (12, 'Rajdeep_S@gmail.com'),
 (13, 'Sakshi_Singh@gmail.com'),
 (14, 'Ranjana_Shetty@gmail.com'),
 (15, 'Sejal_h@gmail.com'),
 (16, 'satish@gmail.com'),
 (17, 'vipul@gmail.com'),
 (4, 'Rishabh_D@gmail.com'),
 (18, 'Rakesh@gmail.com'),
 (19, 'Mukesh@gmail.com'),
 (20, 'Hannah@gmail.com')]

In [39]:
cursor.execute("SELECT A.Department_ID, A.first_name, A.Department, A.Salary, B.email_id FROM worker_table AS A JOIN employee_email AS B ON A.Department_ID = B.Department_ID")

In [40]:
cursor.fetchall()

[(1, 'Rajdeep Singh', 'DSL', 200000000, 'Rajdeep_Singh@gmail.com'),
 (2, 'Raj Singh', 'DSL', 100000000, 'Raj_Singh@gmail.com'),
 (3, 'Deep Singh', 'DSL', 300000000, 'deep_Singh@gmail.com'),
 (5, 'Ritesh D', 'Content', 3000000, 'Ritesh_D@gmail.com'),
 (6, 'Renu', 'Content', 400000, 'Renu@gmail.com'),
 (7, 'Sonakshi Singh', 'HR', 5000000, 'Sonakshi_Singh@gmail.com'),
 (8, 'Salini', 'Product', 6000000, 'Salini@gmail.com'),
 (9, 'Natasha', 'Developer', 8000000, 'Natasha@gmail.com'),
 (10, 'Minakshi', 'Developer', 9000000, 'Minakshi@gmail.com'),
 (11, 'Amitabh', 'Developer', 9500000, 'Amitabh@gmail.com'),
 (12, 'Rajdeep S    ', 'DSL', 200000, 'Rajdeep_S@gmail.com'),
 (13, 'Sakshi Singh    ', 'DSL', 800000, 'Sakshi_Singh@gmail.com'),
 (14, 'Ranjana Shetty    ', 'Content', 900000, 'Ranjana_Shetty@gmail.com'),
 (15, 'Sejal H    ', 'Developer', 950000, 'Sejal_h@gmail.com'),
 (17, 'Satish', 'Content', 25000, 'vipul@gmail.com'),
 (16, 'Vipul', 'Content', 20000, 'satish@gmail.com'),
 (4, 'Rishabh D', 'Content', 2000000, 'Rishabh_D@gmail.com'),
 (16, 'Vipul', 'Content', 20000, 'satish@gmail.com'),
 (4, 'Rishabh D', 'Content', 2000000, 'Rishabh_D@gmail.com'),
 (18, 'Rakesh', 'Product', 30000, 'Rakesh@gmail.com'),
 (19, 'Mukesh', 'Product', 20000, 'Mukesh@gmail.com'),
 (20, 'Hannah', 'Product', 20000, 'Hannah@gmail.com')]

                                       Keep Learning, Keep Growing...